script.yml
config:
  target: "https://mnagy.cluster-cbpln433zd2q.us-east-1.neptune.amazonaws.com:8182/gremlin"
  phases:
    - duration: 10
      arrivalRate: 2
      name: Warm up
    - duration: 10
      arrivalRate: 10
      name: Sustained load
scenarios:
  - name: "Write"
    flow:
      - post:
          url: "/"
          json: 
            gremlin: "g.addV('place').property(id,'All Company').property('name','All Company').next()"
  - name: "Read"
    flow:
      - post:
          url: "/"
          json: 
            gremlin: "g.V().limit(1)"