script.yml
config:
  target: "http://mnagy2-740713273.us-east-1.elb.amazonaws.com/gremlin"
  phases:
    - duration: 5
      arrivalRate: 2
      name: Warm up
    - duration: 10
      arrivalRate: 100
      name: Sustained load
  payload:
    path: "./variables10.csv"
    fields:
      - "place"
      - "user"
scenarios:
  - name: "Read"
    flow:
      - post:
          url: "/"
          json:
            gremlin: "g.V('{{ place }}').repeat(out('parent')).until(inE('read').otherV().inE('memberOf').otherV().has(id, '{{ user }}'))"